http://sysadm.pp.ua/linux/sistemy-virtualizacii/vagrant-box-creation.html  создание бокса вагрант 


Чтобы удалить виртуальную машину используется команда:
vagrant destroy
для начала создаем вагрант файл прописываем параметры машины после скачаем бокс.Нужно перейти на сайт Vagrant.com вабрать какой нужен бок и скопировать ссылку.
С помощью команды wget"сслыка на скачивание бокса и путь куда он сохраниться"
wget https://app.vagrantup.com/centos/boxes/7/versions/2004.01/providers/virtualbox.box ссылка для скачивание центос
после скачиваиня бокса, заходим в репозиторий где у нас лежит созданный вангрант файл и импортируем туда наш скаченный бокс с помощь следуюзей команды vagrant box add имя файла импорта --name centos/7
 после импорта создаем создаем саму машину командой vagrant up кодма машина создались заходим в нее с помощью команды vagrant ssh
